Revit 2024 API
ParameterTypeId.RbsPipeSegmentParam Property
 "Pipe Segment"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RbsPipeSegmentParam { get; }
Visual Basic
Public Shared ReadOnly Property RbsPipeSegmentParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RbsPipeSegmentParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace